In [194]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')
from matplotlib import pyplot as plt

In [195]:
dataset = [8, 9, 2, 10, 3, 5, 7, 12, 15]

In [196]:
Q1 = np.percentile(dataset, 25)
Q1

5.0

In [197]:
Q2 = np.percentile(dataset, 50)
Q2

8.0

In [198]:
Q3 = np.percentile(dataset, 75)
Q3

10.0

In [199]:
df = pd.read_excel("shop.xlsx")

In [200]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [201]:
df.shape

(50, 5)

In [202]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [203]:
df.columns

Index(['Marketing Spend', 'Administration', 'Transport', 'Area', 'Profit'], dtype='object')

In [204]:
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()

# Normalization

In [205]:
from sklearn.preprocessing import MinMaxScaler
mm = MinMaxScaler(feature_range = (0, 1))

In [206]:
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [207]:
df1['Marketing Spend'] = mm.fit_transform(df1[['Marketing Spend']])

In [208]:
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [209]:
df1['Administration'] = mm.fit_transform(df1[['Administration']])
df1['Transport'] = mm.fit_transform(df1[['Transport']])
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# Standardization

In [210]:
from sklearn.preprocessing import StandardScaler
ss = StandardScaler()

In [211]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [212]:
df2['Marketing Spend'] = ss.fit_transform(df2[['Marketing Spend']])

In [213]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913       136897.80  471784.10    Dhaka  192261.83
1         1.955860       151377.59  443898.53      Ctg  191792.06
2         1.754364       101145.55  407934.54  Rangpur  191050.39
3         1.554784       118671.85  383199.62    Dhaka  182901.99
4         1.504937        91391.77  366168.42  Rangpur  166187.94

In [214]:
df2['Profit'] = ss.fit_transform(df2[['Profit']])

In [215]:
df2.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.897913       136897.80  471784.10    Dhaka  2.011203
1         1.955860       151377.59  443898.53      Ctg  1.999430
2         1.754364       101145.55  407934.54  Rangpur  1.980842
3         1.554784       118671.85  383199.62    Dhaka  1.776627
4         1.504937        91391.77  366168.42  Rangpur  1.357740

# Robust Scaler

In [216]:
from sklearn.preprocessing import RobustScaler
rs = RobustScaler()

In [217]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [218]:
df3['Transport'] = rs.fit_transform(df3[['Transport']])

In [219]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80   1.552016    Dhaka  192261.83
1        162597.70       151377.59   1.383714      Ctg  191792.06
2        153441.51       101145.55   1.166654  Rangpur  191050.39
3        144372.41       118671.85   1.017368    Dhaka  182901.99
4        142107.34        91391.77   0.914576  Rangpur  166187.94

# Max Absolute Scaler

In [220]:
from sklearn.preprocessing import MaxAbsScaler
mb = MaxAbsScaler()

In [221]:
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [222]:
df4['Transport'] = mb.fit_transform(df4[['Transport']])

In [223]:
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80   1.000000    Dhaka  192261.83
1        162597.70       151377.59   0.940893      Ctg  191792.06
2        153441.51       101145.55   0.864664  Rangpur  191050.39
3        144372.41       118671.85   0.812235    Dhaka  182901.99
4        142107.34        91391.77   0.776136  Rangpur  166187.94